{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "dense_200_input"}, "name": "dense_200_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "dense_204_input"}, "name": "dense_204_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "dense_208_input"}, "name": "dense_208_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "dense_212_input"}, "name": "dense_212_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "dense_216_input"}, "name": "dense_216_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_200", "trainable": false, "batch_input_shape": [null, 21], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_200", "inbound_nodes": [[["dense_200_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_204", "trainable": false, "batch_input_shape": [null, 21], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_204", "inbound_nodes": [[["dense_204_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_208", "trainable": false, "batch_input_shape": [null, 21], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_208", "inbound_nodes": [[["dense_208_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_212", "trainable": false, "batch_input_shape": [null, 21], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_212", "inbound_nodes": [[["dense_212_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_216", "trainable": false, "batch_input_shape": [null, 21], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_216", "inbound_nodes": [[["dense_216_input", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_100", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_100", "inbound_nodes": [[["dense_200", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_102", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_102", "inbound_nodes": [[["dense_204", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_104", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_104", "inbound_nodes": [[["dense_208", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_106", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_106", "inbound_nodes": [[["dense_212", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_108", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_108", "inbound_nodes": [[["dense_216", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_201", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_201", "inbound_nodes": [[["dropout_100", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_205", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_205", "inbound_nodes": [[["dropout_102", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_209", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_209", "inbound_nodes": [[["dropout_104", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_213", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_213", "inbound_nodes": [[["dropout_106", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_217", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_217", "inbound_nodes": [[["dropout_108", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_101", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_101", "inbound_nodes": [[["dense_201", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_103", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_103", "inbound_nodes": [[["dense_205", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_105", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_105", "inbound_nodes": [[["dense_209", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_107", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_107", "inbound_nodes": [[["dense_213", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_109", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_109", "inbound_nodes": [[["dense_217", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_202", "trainable": false, "dtype": "float32", "units": 18, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_202", "inbound_nodes": [[["dropout_101", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_206", "trainable": false, "dtype": "float32", "units": 18, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_206", "inbound_nodes": [[["dropout_103", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_210", "trainable": false, "dtype": "float32", "units": 18, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_210", "inbound_nodes": [[["dropout_105", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_214", "trainable": false, "dtype": "float32", "units": 18, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_214", "inbound_nodes": [[["dropout_107", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_218", "trainable": false, "dtype": "float32", "units": 18, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_218", "inbound_nodes": [[["dropout_109", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_203", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_203", "inbound_nodes": [[["dense_202", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_207", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_207", "inbound_nodes": [[["dense_206", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_211", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_211", "inbound_nodes": [[["dense_210", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_215", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_215", "inbound_nodes": [[["dense_214", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_219", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_219", "inbound_nodes": [[["dense_218", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["dense_203", 0, 0, {}], ["dense_207", 0, 0, {}], ["dense_211", 0, 0, {}], ["dense_215", 0, 0, {}], ["dense_219", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_220", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_220", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_221", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_221", "inbound_nodes": [[["dense_220", 0, 0, {}]]]}], "input_layers": [["dense_200_input", 0, 0], ["dense_204_input", 0, 0], ["dense_208_input", 0, 0], ["dense_212_input", 0, 0], ["dense_216_input", 0, 0]], "output_layers": [["dense_221", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}